CSI API ETABS v1
cAreaObj.GetSelectedEdge Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSelectedEdge(
	string Name,
	ref int NumberEdges,
	ref bool[] Selected
)
Function GetSelectedEdge (
	Name As String,
	ByRef NumberEdges As Integer,
	ByRef Selected As Boolean()
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim NumberEdges As Integer
Dim Selected As Boolean()
Dim returnValue As Integer
returnValue = instance.GetSelectedEdge(Name,
	NumberEdges, Selected)
int GetSelectedEdge(
	String^ Name,
	int% NumberEdges,
	array<bool>^% Selected
)
abstract GetSelectedEdge :
        Name : string *
        NumberEdges : int byref *
        Selected : bool[] byref -> int
Parameters
Name
Type: System.String
NumberEdges
Type: System.Int32
Selected
Type: System.Boolean[]
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace